Revit 2026 API

# PointCloudOverrides Class

---

Graphic overrides that are stored by a view to be applied to a PointCloudInstance element, or a scan within the element.

SystemObject Autodesk.Revit.DB.PointCloudsPointCloudOverrides

**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PointCloudOverrides : IDisposable
```
```vb
Public Class PointCloudOverrides
	Implements IDisposable
```
```cpp
public ref class PointCloudOverrides : IDisposable
```
```fsharp
type PointCloudOverrides =
    class
        interface IDisposable
    end
```

The PointCloudOverrides type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PointCloudOverrides | Constructs empty overrides object. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | ArePointCloudOverrideSettingsValid | Checks if PointCloudOverrideSettings are valid |
|  | Assign | Assigns values of the source overrides to this object. |
|  | Dispose | Releases all resources used by the PointCloudOverrides |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetPointCloudRegionOverrideSettings(ElementId) | Gets region override settings assigned to the whole PointCloudInstance element. |
|  | GetPointCloudRegionOverrideSettings(ElementId, String, Document) | Gets override settings assigned to a particular region within a PointCloudInstance element. |
|  | GetPointCloudScanOverrideSettings(ElementId) | Gets scan override settings assigned to the whole PointCloudInstance element. |
|  | GetPointCloudScanOverrideSettings(ElementId, String, Document) | Gets override settings assigned to a particular scan within a PointCloudInstance element. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Check if the contents of two overrides are equal. |
|  | SetPointCloudRegionOverrideSettings(ElementId, PointCloudOverrideSettings) | Assigns region override settings to the whole PointCloudInstance element. |
|  | SetPointCloudRegionOverrideSettings(ElementId, PointCloudOverrideSettings, String, Document) | Assigns override settings to a particular region within a PointCloudInstance element. |
|  | SetPointCloudScanOverrideSettings(ElementId, PointCloudOverrideSettings) | Assigns scan override settings to the whole PointCloudInstance element. |
|  | SetPointCloudScanOverrideSettings(ElementId, PointCloudOverrideSettings, String, Document) | Assigns scan override settings to a particular scan within a PointCloudInstance element. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.PointClouds Namespace